{"about":"LibMol is an open-source educational application, dedicated to teaching structural biology.  \nLibmol is available as an [online application](https://libmol.org) (accessible from a browser without installation) or a [downloadable executable](https://libmol.org/downloads).\n\n## Author\n[Paul Pillot](mailto:paul.pillot@libmol.org) - Life Sciences teacher at the Collège International Marie de France (Montreal - Canada)\n\n\n## Licence\nThe source code is published under the terms of the [free license GPL v3.0](https://www.gnu.org/licenses/gpl.html). It is freely available, downloadable and editable from the following [github repository](https://github.com/ppillot/libmol)\n\n## Aknowledgements\n### Contributions\n- Hervé Furstoss (embedded documentation)\n- Philippe Cosentino, Sandrine Beaudin, Eric Jourdan, Valérie Rambaud,  Jacques Janin, Frédéric Labaune, Sandra Rodot, Sébastien Gruszka, Nazim Sellal, David Bard, Mélanie Fenaert for their extensive tests and suggestions\n- Alexander Rose, main author of NGL for his commitment to creating a powerful, streamlined and web-optimized molecular visualization library.\n\n### Molecular data\n- [Protein Data Bank](https://www.rcsb.org)  \nH.M. Berman, J. Westbrook, Z. Feng, G. Gilliland, T.N. Bhat, H. Weissig, I.N. Shindyalov, P.E. Bourne.\n(2000) _The Protein Data Bank_ [Nucleic Acids Research, 28: 235-242](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC102472/)\n- [Pubchem](https://pubchem.ncbi.nlm.nih.gov/)  \nKim S, Thiessen PA, Bolton EE, Chen J, Fu G, Gindulyte A, Han L, He J, He S, Shoemaker BA, Wang J, Yu B, Zhang J, Bryant SH. PubChem Substance and Compound databases. Nucleic Acids Res. 2016 Jan 4; 44(D1):D1202-13. Epub 2015 Sep 22 [doi:10.1093/nar/gkv951](http://dx.doi.org/10.1093/nar/gkv951)\n\n### Libraries\nLibMol is based on several invaluable open-source libraries or services.\n- [NGL](https://github.com/arose/ngl) for 3D visualization of molecular models\n  - AS Rose, AR Bradley, Y Valasatava, JM Duarte, A Prlić and PW Rose. _Web-based molecular graphics for large complexes._ ACM Proceedings of the 21st International Conference on Web3D Technology (Web3D '16): 185-186, 2016. [doi:10.1145/2945292.2945324](http://dx.doi.org/10.1145/2945292.2945324)\n  - AS Rose and PW Hildebrand. _NGL Viewer: a web application for molecular visualization._ Nucl Acids Res (1 July 2015) 43 (W1): W576-W579 first published online April 29, 2015. [doi:10.1093/nar/gkv402](https://doi.org/10.1093/nar/gkv402)\n- [Vue.js](https://vuejs.org/) and its ecosystem for the software infrastructure\n- [Vuei18n](https://github.com/kazupon/vue-i18n): i18n plugin\n- [ElementUI](http://element.eleme.io/#/en-US): user interface framework\n- [screenfull](https://www.npmjs.com/package/screenfull): fullscreen support\n- [split.js](https://nathancahill.github.io/Split.js/): adjustable split views\n- [Fontello](http://fontello.com): icon fonts generator  \n\n### Icons \n- [Font Awesome](http://fortawesome.github.com/Font-Awesome/)\n   Copyright (C) 2016 by Dave Gandy  \n   Author:    Dave Gandy  \n   License:   [SIL](http://scripts.sil.org/OFL)  \n- [Elusive](http://aristeides.com/):  \n   Copyright (C) 2013 by Aristeides Stathopoulos  \n   Author:    Aristeides Stathopoulos  \n   License:   [SIL](http://scripts.sil.org/OFL) ","colorBychain":"# Colour by chain\nThis color scheme makes use of a different color for each chain present in the molecular model.\n\nProminent chains constituents are:\n* [proteins](lexicon-protein), made of one or more amino acid chain\n* [nucleic acids](lexicon-nucleic) (DNA or RNA), made of nucleotide chains\n\n[Ligands](lexicon-ligand) (water, ions, hemes,...) in association with a biological polymer (protein or nucleic acid) are also considered as part of the chain and are colored like the rest of it.  \n\n**Example: protein made of 4 chains:**  \n![Hemoglobin colored by chains](static/img/colochain.png)    \nThe labels in the status bar beneath the visualization frame, list the different chains by their IDs and their respective colors.  \n**Tip**: Hovering over the chains name displays a tooltip with the chain's extensive and relevant biological name (if provided in the molecular file)","colorByelement":"# Color CPK (by element)\nEach atom is colored accordingly with chemestry's conventional coloring scheme ([CPK Coloration](lexicon-cpk)). This scheme informs on the different chemical elements that are part of a molecule.\n\nSymbol | Color code | Element\n------------ | ------------- | -------------\n**C** | ![Carbon](static/img/c.png)| **Carbon**\n**H** | ![Hydrogen](static/img/h.png) | **Hydrogen**\n**O** | ![Oxygen](static/img/o.png) | **Oxygen** \n**N** | ![Nitrogen](static/img/n.png) | **Nitrogen**\n**S** | ![Sulfur](static/img/s.png) | **Sulfur** \n**P** | ![Phosphorus](static/img/p.png) | **Phosphorus** \n\n**Beware**, most macromolecular models don't include **hydrogens**, despite those being present in reality. [Structures determination techniques](lexicon-technique) generally can't resolve hydrogen atoms coordinates.  \n\nThe labels in the status bar beneath the visualization frame, list the different atomic elements by their symbols and their respective colors.  \n**Tip**: Hovering over the elements symbols reveals a tooltip with the complete atom name.","colorBynature":"# Colour by biochemical nature\nThis color scheme colors atoms accordingly with the biochemical nature of the compound they are in.  \n\nMain compounds identified are:\n* proteins,\n* nucleic acids (DNA and RNA),\n* saccharides,\n* water,\n* ions,\n* [hetero atoms](lexicon-hetero).  \n\n**Example molecular model with varied biochemical compounds:**  \n![biochemical nature coloration](static/img/colonat.png)   \n\nEvery atom that is not part of a defined set is classified as hetero. This group is subsequently very diverse.  \n\nLabels in the status bar beneath the visualization frame, specify every biochemical nature present in the model and its corresponding color.","colorByresidue":"# Colour by residue\nA residue regroups atoms that make a subunit of a chain (or polymer) in a molecular model. Each residue (or group of residues chemically akin to each other) has a specific color.\n\nThere are several types of residues depending on the biochemical nature of the chain.  \nMain groups are:\n* [amino acids](lexicon-aminoacid), that make proteins,\n* [nucleotides](lexicon-nucleotide), that make [nucleic acids](lexicon-nucleic) (DNA or RNA).\n\nOther kinds of residues, such as [ligands](lexicon-ligand) (saccharides, prosthetic groups, ions, etc...) and solvents (water) may also be part of molecular models.\n\nLabels in the status bar beneath the visualization frame, specify every residue present in the model by its ID and its corresponding color.  \n**Tip**: Hovering over a residue's ID triggers a tooltip with its extended name (if this information is available from the model file).","colorBysstruc":"# Colour by secondary structure\n\nThis color scheme reveals specific motifs of amino acids disposition favored in proteic chains, known as **secondary structures**. This option is only available when proteins are selected and displayed with a simplified representation ([backbone](display-backbone) or [cartoon](display-cartoon)).\n\nSecondary structures recognized are:\n* [beta strands](lexicon-strand),  \nBeta strands (β strands) are linear successions of amino acids generally combined to make planar or cylindrical associations in the protein structure.\n* [turns](lexicon-turn),  \nTurns are brutal change of direction in the orientation of an amino acids chain.\n* [alpha helices](lexicon-helix),  \nAlpha helix (α helix) appears when the amino acid chain coils along an axis. Alpha helix contains an average of 3.6 amino acids per helical turn.\n* [3-10 helices](lexicon-helix).  \n3-10 helix is a shorter motif compared to alpha helix, having only 3 amino-acids per helical turn.\n\nThese motifs are stabilized through hydrogen bonding between amino acids.\n\nLabels in the status bar beneath the visualization frame list each secondary structure with its corresponding color.  \nSecondary structures assignment to specific portions of the amino acid chain is provided by the molecular file. If this information is not available, a computation is performed using fast Zhang & Skolnick TM-align method, which may lead to discrepant results.","colorPalette":"# Color palette\nThis is a user defined color. The color picked is assigned to every atom in the current selection set.  \nIts main use is to highlight a specific portion of the molecular model.\n\nTo use it:\n* first, select the part you want to highlight\n* then color it by picking a relevant color from the palette \n\nThe chosen color is also displayed as a label in the status bar.","displayBackbone":"# Backbone representation\nThis representation is a simplified display only applying to proteins and nucleic acids (DNA or RNA).  \n![Backbone](static/img/squ2.png)  \nThe backbone is a broken line passing by one representative atom in each residue of the polymer: \n* in proteins, these are the **alpha-carbons** (α-carbons) of each amino-acid. Alpha-carbons join the pepdidic bonds with the amino-acid distinctive sidechains.\n![Peptidic backbone](static/img/squ1.png)  \n* in nucleic acids, these are the **C3'-carbons** in the nucleotides (deoxy)riboses.  \n![Nucleic backbone](static/img/sqeun.png)   \n\nThe backbone reflects the structural basis of the polymer, around which the other functionally diverse compounds (amino acids side chains and nucleic bases) are organized and provide to the molecules their biological properties.","displayBallstick":"# Balls and sticks representation\n![Balls and sticks](static/img/bs1.png)  \n\nThis representation displays :\n* **(1)** atoms as spheres, **the balls**, \n* **(2)** covalent bonds as segments, **the sticks**.   \n\nIt is used to visualized all atoms that are part of a molecules and the covalent connexions between them.  \nDue to [hydrogen coordinates determination limitations](lexicon-techniques), water molecules usually appear as single oxygen atoms spheres with this representation. \nBond assignement is infered from the amino acid or nucleotide name in polymers, and should be provided in the coordinate file for every other compound. If not present, a bonding computation is performed and might lead to discrepant results.","displayCartoon":"# Cartoon representation\nThis representation provides a simplified view of **proteins** and **nucleic acids** (DNA or RNA). The cartoon only passes through the atoms that are part of the molecule backbone hiding the diverse side chains or nucleic bases.  \n![Ruban](static/img/ruban2.png) \n\nIn **proteins**:  \n![Protein cartoon representation](static/img/rubanp.png)  \nThe cartoon passes through the peptidic bonds planes between successive amino acids. Cartoon width varies to emphasize noticeable secondary structures (beta strands, helices,...).\n\nIn **nucleic acids**:  \n![DNA cartoon representation](static/img/rubann.png)  \nThe cartoon trace passes through successives riboses from each nucleotide. Nucleic bases are represented as sticks emerging from the cartoon. \n\nDue to computation limitations, this representation doesn't apply to chains shorter than 3 residues.","displaySpacefill":"# Spacefill representation\n![Spacefill](static/img/spf1.png)  \nThis representation displays:  \n* **(1)** Atoms as spheres whose radii equal the Van der Walls radii, representing the closest distance one can get to the atom.  \n* **(2)** Intersection between two overlapping spheres reveals a chemical bond (mostly covalent) between adjoining atoms.\n\nThis representation is used to visualize the atoms from a molecule and the volume they occupy. Applied to a complete molecule, it gives an idea about its actual shape.","displayStick":"# Licorice representation (sticks)\n![Licorice](static/img/st1.png)   \n\nThis representation use only segments between atoms (**the sticks**) to display the molecule.     \nThese segments provide informations regarding:\n* **(1)** **atoms**, located at the ends of the segments generally marked by angles, \n* **(2)** **covalent bonds**, connecting two atoms.  \n\nIt is used to clearly visualize the covalent bonds between the atoms of a molecule.\nIt also provides a light outline of a molecule or part of it.","hide":"# Hide / Display\nThis control alternatively hides or displays the current selection.  \nThis is convenient to focus on a portion of the molecular model while retaining the representations of the rest.\n\n**Beware** that when a selection or part of it is hidden, no action performed on it will be visible until the Display control is triggered on it.","lexiconAminoacid":"# Amino acids\nAmino acids are biological compounds composing the protein chains. Amino acids have two functionnal groups (amine and carboxyl) that interacts between each other to form peptidic bonds.  \nEach amino acid has a specific sidechain confering its chemical properties. ","lexiconCoude":"# Turns\nTurns are among the main patterns taken by [amino acids](lexicon-aminoacid) chains in a [protein](lexicon-protein) (also known as secondary structures). A turn is a distinguishable fold, hairpin like, in a polypeptidic chain.","lexiconCpk":"# CPK coloring\nThe CPK coloring code (Corey, Pauling and Koltun) is the conventional coloring of atoms used in chemistry. It identifies atomic elements in molecular models.\nThis code was defined by the chemists R. Corey and L. Pauling and then improved by W. Koltun. Currently molecular visualization tools use variations of this initial code.\n\nThe code of the main atoms in organic molecules is:\n\nSymbol | Coloring code | Element\n------------ | ------------- | -------------\n**C** | ![Carbon](static/img/c.png)| **Carbon**\n**H** | ![Hydrogen](static/img/h.png) | **Hydrogen**\n**O** | ![Oxygen](static/img/o.png) | **Oxygen** \n**N** | ![Nitrogen](static/img/n.png) | **Nitrogen**\n**S** | ![Sulfur](static/img/s.png) | **Sulfur** \n**P** | ![Phosphorus](static/img/p.png) | **Phosphorus** \n","lexiconHelix":"# Helices\nHelices are among the main patterns taken by [amino acids](lexicon-aminoacid) chains in a [protein](lexicon-protein) (also known as secondary structures).  \nIn a helix, the amino acid chain is wound around an axis. The side chains of the amino acids point towards the outside of the helix axis. The amino acids in a helix establish hydrogen bonds, with the neighbouring amino acids of the next helical turn and of the previous one.\nDepending on the **pitch** of the helix (number of amino acids per helical turn), different categories of helices are defined (helix α, helix 3-10, helix π having respectively 3.6, 3 and 5 amino acids per helical turn).\n","lexiconHetero":"# Hetero atoms\nThis class of chemical compounds is diverse. It includes all the molecules not belonging to the groups of [proteins](lexicon-protein), [nucleic acids](lexicon-nucleic), water molecules nor carbohydrates.  \nIt contains [ligands](lexicon-ligand) in association with proteins such as heme groups in globins, certain vitamins acting as cofactors, ions involved in catalysis, etc...  \nThese also include lipids surrounding some membrane proteins or other substances used as solvents during the experimental determination.","lexiconLigand":"# Ligands\n**Ligands** are small molecules linked to the studied macromolecules (proteins and nucleic acids). The ligands may be involved in the molecule function.\nThe chemical nature of the ligands can be either organic or mineral.\nOrganic ligands may be carbohydrates, lipids, hemes or any other organic molecules.\nInorganic ligands may be ions, metal atoms or other inorganic molecules.\nThe ligands attach to the macromolecules by covalent or non-covalent bonds (ionic, hydrogen bonds, Van der Waals interactions). \n","lexiconNucleic":"# Nucleic acids (DNA - RNA)\nNucleic acids are large-scale organic molecules whose main role is to store and transmit genetic information.  \nThey are made of a succession of building units: the [nucleotides](lexicon-nucleotide).  \nNucleic acids derive their name from the facts that they were identified first in the nucleus and that the nucleotides contain a **nucleobase** and a **phosphoric acid** part.  \nDNA and RNA difference is based on the type of carbohydrate present in each nucleotide, respectively **deoxyribose** for DNA and **ribose** for RNA.  \nNucleotides bond with their neighbors on the same chain by a covalent bond between the phosphate group and the (deoxy) ribose group.  \nTypically DNA contains two nucleotidic chains, maintained by hydrogen bonds between the nitrogenous bases. RNA is often made of a single chain, which can be folded back on itself, thus forming secondary structures maintained by bonds between bases (loops, pins, etc.).  \nIn Libmol, one can distinguish between the two types of nucleic acids using [color by biochemical nature](color-bynature) coloring pattern. They can be selected distinctively with the DNA or RNA  keyword in the [selection command line](select-command-line).  \n","lexiconNucleotide":"# Nucleotides\nNucleotides are the building blocks of [nucleic acids](lexicon-nucleic) such as __DNA__ or __RNA__. \nA nucleotide is made of three parts:\n* the __Nucleobase__, or __nitrogenous base__. They exist in 5 different main types (__Adenine__, __Guanine__, __Thymine__, __Cytosine__, __Uracile__) which can undergo chemical modifications (particularly in RNAs)\n* the __Carbohydrate__ which can either be a __ribose__ (in RNA), or a __deoxyribose__ (in DNA)\n* the __Phosphate__ group\n","lexiconOther":"# Other atoms","lexiconProtein":"# Proteins\nProteins are large-scale and complex organic molecules made of at least one chain of [amino acids](lexicon-aminoacid).\nAmino acid composition (governed by cell's genetic information) is the main responsible for protein properties such as its shape and function.  \nProteins undertake different roles inside and outside of cells:\n* Communication (peptidic messengers, receptors)\n* Structure (as components of the cytoskeleton, the extracellular matrix, the chromatin and chromosomes ...)\n* Chemical reactions (enzymes)\n* Defense and attack (peptidic toxins, antibodies, receptors of the immune system)\n* Etc...","lexiconStrand":"# Beta strands\nβ-strands are among the main patterns taken by [amino acids](lexicon-aminoacid) chains in a [protein](lexicon-protein) (also known as secondary structures).  \nβ-strands have a planar conformation. Amino acids side chains generally point perpendicularly to the strand's plane. Amino acids bind to neighbouring strands through hydrogen bonding. Adjoining β-strands may form larger scale structures such as barrels.\n","lexiconTechnique":"# Techniques for determining the structure of molecules.\n\nMolecules are inaccessible to direct observation by conventional techniques. Indirect techniques are used to devise models of these molecules.\n\n## X-ray Crystallography\nThe molecule studied is purified and then placed under crystallization conditions so as to form an ordered stack. When an X-ray beam is aimed at this crystal, the electro-magnetic waves are diffracted and make interference figures on a detector (a set of spots). The locations of these spots depend on the electronic cloud of the molecule, which can be reconstituted by mathematical methods.  \nThe amino acids making the protein can then be fitted into this electronic cloud so as to build a complete model.  \nThis method is the most commonly used for molecular models determination. The resolution is usually too sparse for determining the positions of the hydrogen atoms.  which do not appear in the models. It may be noted that this is only a model and that during the determination, the molecules studied are conditions far removed from the biological conditions. On the other hand, some proteins do not crystallize and can not be determined by this technique.\n\n## Nuclear Magnetic Resonance Spectroscopy (NMR)\nA solution of the sample to be analyzed is placed in a strong magnetic field. The atoms are subjected to radio waves. The analysis of the observed resonances is used to determine the neighboring atoms as well as the conformation of the bonded atoms. From these informations a set of restraints is obtained and used to find the different possible models in accordance. Thus, the NMR technique leads to a set of several possible models. It is suitable for small to medium molecules and has the advantage of being applied to molecules in solution, which is closer than crystals to in vivo conditions.\n\n## 3D electron microscopy (3DEM)\nThis technique is currently in full expansion. The term covers a wide range of experimental procedures. For example, it may consist of imaging large-scale complexes at different viewing angles. Computerized image analysis methods are  applied to create a 3D structure from these datasets. Electron diffraction can be performed if the structure is sufficiently periodic or can be crystallized. When the resolution is low, this technique is combined with crystallography to fit the atomic structures coming from crystallography into the envelope obtained by 3DEM.  \n","selectAll":"# Select all atoms\nThis control selects the **whole set of atoms** present in the molecular model independently of the chemical nature of the compounds they are a part of, nor of the chain to which they belong.\n![Selection](static/img/select.png)\nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made.","selectCommandLine":"# Select by Selection Command\nThis text box allows you to enter a selection command to make more complex selections or faster than through the sequence mode.\nAtoms whose characteristics match the keywords are selected.\n\nOnce the command is correct, enable the selection by pressing the Enter key or clicking on the validation button.\n\nThe pre-visualization of the selection is transiently displayed on mouseover and allows to check the quality of the selection made. The number of atoms included is dislayed in the selection bar. If the selection can not be processed, the text appears in red.\n\n## Examples of select commands\n| Commands | Related Selections |\n| ---------- | -------------------------- |\n| `val` | All the valines |\n| `val and 10` | All valines in position 10 in the chains\n| `:B` | Chain B **(case sensitive)**\n| `10:B` | The amino acid (or nucleotide) at position 10 in the B chain\n| `_C` | All carbon atoms\n| `ala and .ca and not 10` | All alpha carbons of alanines except in the amino acid at position 10\n| `protein and not (:C,:B)` | All atoms belonging to proteins but not to chains C nor B\n\n## Keywords\n| Keyword | Meaning\n| ----------- | ------\n| `all` | All atoms\n| `protein` | Proteins and amino acids\n| `nucleic` | DNA, RNA and nucleotides\n| `dna` | DNA\n| `rna` | RNA\n| `hetero` | hetero\n| `saccharide` | Carbohydrates\n| `ion` | Ions\n| `water` | Water\n| `polymer` | Protein, DNA or RNA\n| `backbone` | Skeleton of a Protein or a Nucleic Acid\n| `sidechain` | Side chain (amino acid) or nucleic base\n| `helix` | Helices\n| `sheet` | Beta sheets\n| `turn` | Secondary structure neither in helices nor in sheets\nSee more keywords in the [NGL documentation](http://arose.github.io/ngl/api/tutorial-selection-language.html)\n\n## Syntax\n| Expression | Meaning\n| --------------- | ---------------\n| `1,2,3` | | Selection of residues by their number\n| `1-10` | Selection of a sequence of residues (here, from 1 to 10)\n| `:A` | Selecting a string from its identifier\n| `#H,#C,#O` | Selection of atoms by their chemical symbol\n| `.CA,.N3` | Selection of atoms by name in the PDB file\n| `ALA,HEM` | Selection of residues by their names\n| `[032],[CT1]` | Selection of residues whose names contain digits\nRefer to [NGL documentation](http://arose.github.io/ngl/api/tutorial-selection-language.html) for more advanced examples\n\nExpressions and keywords can be combined using logical operators (`AND`,` OR`, `NOT`). Parentheses can be used to group expressions and set priorities between combinations.","selectHetero":"# Select other atoms\nThis control selects atoms that are not part of any of the other atom sets (same as not protein, not nucleic, not saccharide, not water). It's a very diverse group, including ligands, ions, membrane lipids, etc...  \n![Select](static/img/select.png)   \nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made.","selectNucleic":"# Select nucleic acids (DNA or RNA)\nThis control selects **nucleic acids** present in the molecular model. Every nucleic chains or individual nucleotides are selected with this command.   \n \nAfter selecting, it's possible to act (represent, color,...) upon these selected atoms without affecting the rest of the molecular model.\n\n![Select nucleic](static/img/selectnuc.png)  \nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made.","selectProtein":"# Select proteins\nThis control selects **proteins** present in the molecular model. Every peptidic chains or individual amino acids are selected with this command.  \n\nAfter selecting, it's possible to act (represent, color,...) upon these selected atoms without affecting the rest of the molecular model.\n\n![Select protein](static/img/selectpro.png)   \nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made.","selectSaccharide":"# Select carbohydrates\nThis control selects **carbohydrates** (or **saccharides**) present in the molecular model. All saccharides are selected with this command indistinctively of their respective chemical nature.   \n\nAfter selecting, it's possible to act (represent, color,...) upon these selected atoms without affecting the rest of the molecular model.   \n\n![Select saccharides](static/img/selectglu.png)  \nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made.","selectWater":"# Select water\nThis control selects **water molecules** present in the molecular model. Generally they appear as isolated oxygen atoms because hydrogens positions can not be solved from the data gathered with most experimental structure determination [techniques](lexicon-technique). Only some of the water molecules present appear in the model as their position can vary between the different unitcells composing the crystal used for determination.   \n\nAfter selecting, it's possible to act (represent, color,...) upon these selected atoms without affecting the rest of the molecular model.\n   \n\n![Select water](static/img/selecteau.png)  \nThe pre-visualization of the selection is transiently displayed when the mouse hovers and makes it possible to check the quality of the selection made."}