{"colorBychain":"# Coloration par chaînes\r\nLa coloration par chaînes identifie les différentes chaînes présentes dans le modèle moléculaire et les colore de manière distincte.\r\n\r\nLes principales chaînes identifiées sont :\r\n* les [protéines](lexicon-protein), constituées d'une ou plusieurs chaînes d'acides aminés,\r\n* les [acides nucléiques](lexicon-nucleic) (ADN et ARN), constituées de chaînes de nucléotides.\r\n\r\nLes [ligands](lexicon-ligand) (eau, ion, hème, ...) associés à une chaîne (protéine ou acide nucléiques) sont également colorés avec les autres atomes de cette chaîne.   \r\n**Exemple d'une protéine à 4 chaînes :**\r\n![Sélection](static/img/colochain.png)    \r\nLa légende du modèle moléculaire indique les différentes chaînes repérées par leurs identifiants et par leurs colorations spécifiques.","colorByelement":"# Coloration par atomes\r\nLes atomes sont colorés selon les conventions de la chimie ([coloration CPK](lexicon-cpk)). Ce mode de coloration permet de distinguer les différents éléments chimiques d'une molécule.\r\n\r\nSymbole | Code couleur | Atome\r\n------------ | ------------- | -------------\r\n**C** | ![Carbone](static/img/c.png)| **Carbone**\r\n**H** | ![Hydrogène](static/img/h.png) | **Hydrogène**\r\n**O** | ![Oxygène](static/img/o.png) | **Oxygène** \r\n**N** | ![Azote](static/img/n.png) | **Azote**\r\n**S** | ![Soufre](static/img/s.png) | **Soufre** \r\n**P** | ![Phosphore](static/img/p.png) | **Phosphore** \r\n\r\n**Attention**, dans la plupart des modèles de macromolécules (Protéines et acides nucléiques) les atomes d'**hydrogène**, bien que présents, ne sont pas représentés. Certaines [techniques](lexicon-technique) ne permettent pas de déterminer la position des atomes d'hydrogène lors de l'étude de la structure tridimensionnelle des molécules.  \r\n\r\nLa légende du modèle moléculaire indique les atomes identifiés et leurs colorations.","colorBynature":"# Coloration par nature\r\nLa coloration par nature identifie la nature chimique des constituants du modèle moléculaire et les colore en fonction de leur nature chimique.\r\n\r\nLes principaux groupes identifiés sont :\r\n* les protéines,\r\n* les acides nucléiques (ADN et ARN),\r\n* les glucides,\r\n* l'eau,\r\n* les ions,\r\n* les [autres atomes](lexicon-autre).\r\n**Exemple d'un modèle de natures variées :**\r\n![Sélection](static/img/colonat.png)   \r\nTout atome non affecté à un autre groupe est intégré aux autres atomes. Ce groupe est donc très hétérogène et regroupe toutes les molécules chimiques différentes de celles qui sont identifiées. \r\n\r\nLa légende du modèle moléculaire indique pour chaque type de nature chimique repéré son identifiant et sa coloration spécifique.","colorByresidue":"# Coloration par résidus\r\nUn résidu est un groupe d'atomes constituant une sous-unité d'une chaîne dans un modèle moléculaire. Chaque résidu est identifié par une coloration spécifique.\r\n\r\nIl y a plusieurs types de résidus selon la nature de la chaîne.  \r\nLes principaux résidus sont :\r\n* les [acides aminés](lexicon-aminoacid) formant les protéines,\r\n* les [nucléotides](lexicon-nucleotide) formant les [acides nucléiques](lexicon-nucleic) (ADN et ARN).\r\n\r\nDes résidus de différentes natures, les [ligands](lexicon-ligand), peuvent également être présents dans les modèles moléculaires :\r\n* des ligands organiques (glucides, lipides, hème, ...),\r\n* des ligands minéraux (eau, ions, atomes  métalliques, ...).\r\n\r\nLa légende du modèle moléculaire indique pour chaque type de résidu repéré son identifiant et sa coloration spécifique.","colorBysstruc":"# Coloration par structure\r\n\r\nLa coloration par structure identifie des motifs particuliers dans la structure d'une chaine d'acides aminés des protéines et les colore de manière spécifique. Ce mode de coloration ne s'active que lorsque la sélection porte sur les protéines et pour des modes d'affichage simplifié (squelette ou ruban).\r\n\r\nLes motifs identifiés sont :\r\n* les [feuillets bêta](lexicon-feuillet),\r\n#### Une feuillet bêta est un motif formé par plusieurs segments de la chaine d'acides aminés qui s'alignent pour former des zones planes dans la protéine. \r\n* les [coudes](lexicon-coude),\r\n#### Un coude est un repli marqué, en épingle à cheveux, dans une chaine d'acides aminés d'une protéine.\r\n* les [hélices alpha](lexicon-helice),\r\n#### Une hélice alpha est un motif formé par l'enroulement de la chaine d'acides aminés pour former une hélice en génral allongée. L'hélice alpha comporte 3,6 acides aminés par tour d'hélice.\r\n* les [hélices 3-10](lexicon-helice).\r\n#### Une hélice 3-10 est un motif en hélice plus court et plus compact (3 acides aminés par tour) que l'hélice alpha. \r\n\r\nLes différents motifs sont stabilisés par des liaisons hydrogènes établies entre les acides aminés impliqués dans les structures.\r\n\r\nLa légende du modèle moléculaire indique pour chaque type de motif structural repéré son identifiant et sa coloration spécifique.","colorPalette":"# Coloration par palette\r\nLa coloration par palette est définie par l'utilisateur. Elle s'applique à la sélection en cours.\r\nElle permet de repérer spécifiquement une partie du modèle moléculaire par sa couleur.\r\n\r\nPour l'utiliser :\r\n* Sélectionner une partie de la molécule,\r\n* Colorer cette sélection par un clic sur la couleur choisie sur la palette proposée.\r\n\r\nLa légende du modèle moléculaire indique la couleur définie par l'utilisateur.","displayBackbone":"# Affichage du squelette\r\nLe mode \"Squelette\" est un mode d'affichage simplifié qui ne s'applique qu'aux protéines et aux acides nucléiques (ADN et ARN).  \r\n![Squelette](static/img/squ2.png)  \r\nLa représentation de la molécule est limité aux atomes qui sont responsables de la polymérisation de la chaine des résidus, le **squelette carboné** :\r\n* pour les protéines, ce sont les atomes impliqués dans les liaisons peptidiques entre les acides aminés d'une chaine, \r\n![Squelette](static/img/squ1.png)  \r\n* pour les acides nucléiques, ce sont les atomes impliqués dans les liaisons entre les nucléotides d'un brin.  \r\n![Squelette](static/img/sqeun.png)   \r\n\r\nCes enchainements d'atomes sont représentés sous la forme de bâtonnets qui permettent ainsi de représenter la stucture globale de la chaîne (le squelette) autour de laquelle s'organisent les autres atomes pour donner aux molécules leurs propriétés fonctionnelles.","displayBallstick":"# Affichage en boules et bâtonnets\r\n![Boules et bâtonnets](static/img/bs1.png)  \r\n\r\nL'affichage en boules et bâtonnets représente :\r\n* **(1)** les atomes par des sphères, **les boules**, \r\n* **(2)** les liaisons covalentes par des segments de droite, **les bâtonnets**.   \r\n\r\nElle permet de bien visualiser les atomes constituants une molécule et les liaisons chimiques entre ces atomes.","displayCartoon":"# Affichage en rubans\r\nLe mode \"Rubans\" est un mode d'affichage simplifié qui ne s'applique qu'aux **protéines** et aux **acides nucléiques** (ADN et ARN). Seul les atomes constituant le squelette de la molécule sont représentés sous une forme symbolisée. ![Ruban](static/img/ruban2.png)   \r\nCette représentation permet d'approcher la stucture globale de la chaîne (le squelette) autour de laquelle s'organisent les autres atomes pour donner aux molécules leurs propriétés fonctionnelles.      \r\n      \r\nPour **les protéines** : \r\n![Protéine en ruban](static/img/rubanp.png)   \r\nLa représentation de la molécule est limitée aux atomes responsables de la polymérisation de la chaine des acides aminés. Ce sont les atomes impliqués dans les liaisons peptidiques entre les acides aminés d'une chaine.  La représentation du ruban est modulée pour faire mieux apparaitre les motifs particuliers dans la structure de la chaine (feuillets, coudes, hélices, ...).\r\n\r\nPour **les acides nucléiques** : \r\n![ADN en ruban](static/img/rubann.png)   \r\nLa représentation de la molécule est limitée aux atomes impliqués dans les liaisons entre les nucléotides d'un brin sous la forme d'un ruban et aux bases azotées sous la forme d'un bâtonnet permendiculaire au ruban.","displaySpacefill":"# Affichage en sphères\r\n![Sphères](static/img/spf1.png)  \r\nL'affichage en sphères représente :  \r\n* **(1)** les atomes par une sphère dont le diamètre correspond au volume occupé par le nuage électronique de l'atome. Le rayon de cette sphère est le rayon de van der Waals.  \r\n* **(2)** L'intersection entre deux sphères  indique une liaison chimique entre deux atomes, ils partagent une partie de leurs nuages électroniques.\r\n\r\nElle permet de bien visualiser les atomes constituant une molécule et le volume occupé par les atomes et la molécule.","displayStick":"# Affichage en bâtonnets\r\n![Bâtonnets](static/img/st1.png)   \r\n\r\nL'affichage en bâtonnets représente la molecule par des segments de droite de diamètre constant, **les bâtonnets**.   \r\nIls correspondent :\r\n* **(1)** aux **atomes**, situés aux extrémités des segments, en général marqués par des angles, \r\n* **(2)** et aux **liaisons covalentes**, reliant deux atomes.  \r\n\r\nElle permet de bien visualiser les liaisons chimiques reliant les atomes d'une molécule.  \r\nCe mode de représentation permet de simplifier la représentation d'une molécule ou d'une partie de molécule.","hide":"# Cacher / Montrer\r\nLa commande Cacher / Montrer permet de cacher ou de réafficher alternativement la sélection en cours.\r\n\r\n**Attention**, lorsqu'une sélection est **cachée** aucune action ne sera visible sur ces atomes tant que la commande **Montrer** n'aura pas été réalisée pour cette sélection.","lexiconAminoacid":"# Acides aminés","lexiconAutre":"# Autres atomes","lexiconCoude":"# Les coudes","lexiconCpk":"# Coloration CPK\r\nLe code de couleurs CPK (Corey, Pauling et Koltun) est la convention de coloration des atomes en chimie. Il permet d'identifier les atomes dans les modèles moléculaires.  \r\nCe code a été défini par les chimistes R. Corey et L. Pauling puis amélioré par W. Koltun. Actuellement les outils de visualisation moléculaire utilisent des variations de ce code initial. \r\n\r\nLe code des principaux atomes des molécules organiques est :\r\n\r\nSymbole | Code couleur | Atome\r\n------------ | ------------- | -------------\r\n**C** | ![Carbone](static/img/c.png)| **Carbone**\r\n**H** | ![Hydrogène](static/img/h.png) | **Hydrogène**\r\n**O** | ![Oxygène](static/img/o.png) | **Oxygène** \r\n**N** | ![Azote](static/img/n.png) | **Azote**\r\n**S** | ![Soufre](static/img/s.png) | **Soufre** \r\n**P** | ![Phosphore](static/img/p.png) | **Phosphore** \r\n\r\nChaque élément chimique du tableau de Medeleev est coloré selon une teinte de ce code de couleur CPK.","lexiconFeuillet":"# Les feuillets bêta","lexiconHelice":"# Les hélices","lexiconHetero":"# Hétéro-atomes","lexiconLigand":"# Ligands\r\nLes **ligands** sont des molécules de petite taille, liées aux macromolécules (protéines et acides nucléiques) étudiées. Les ligands participent généralement au fonctionnement de la molécule étudiée.  \r\nLa nature chimique des ligands est variable soit organique, soit minérale.\r\nLes ligands de nature organique peuvent être des glucides, des lipides, des hèmes ou encore d'autres molécules organiques.\r\nLes ligands de nature minérale ou inorganique peuvent être des ions, des atomes métalliques ou d'autres molécules inorganiques.\r\nLes ligands sont liés aux macromolécules par des liaisons non-covalentes qui peuvent être des liaisons ionniques, des liaisons hydrogènes ou encore des forces de van des Waals. \r\n","lexiconNucleic":"# Acides nucléiques (ADN - ARN)","lexiconNucleotide":"# Nucléotides","lexiconProtein":"# Protéine","lexiconTechnique":"# Les techniques de détermination de la structure des molécules.\r\n\r\nCristallographie aux rayons X\r\n\r\nSpectroscopie par résonance magnétique nucléaire (RMN)","selectAll":"# Sélectionner tous les atomes\r\nLa commande sélectionne l'**ensemble des atomes** du modèle moléculaire quelle que soit la nature chimique des atomes et quelle que soit la chaine à laquelle ils appartiennent.   \r\n![Sélection](static/img/select.png)   \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée.","selectHetero":"# Sélectionner les autres atomes\r\nLa sélection s'applique aux atomes qui n'appartiennent à aucun des autres types de molécules identifiées.  \r\nIl s'agit donc d'une groupe hétérogène.   \r\n![Sélection](static/img/select.png)   \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée.","selectNucleic":"# Sélectionner les acides nucléiques (ADN - ARN)\r\nLes **acides nucléiques** présents dans le modèle moléculaire sont repérées et sélectionnées. Lorsque plusieurs types d'acides nucléiques ou plusieurs brins sont présents, ils sont tous sélectionnés sans distinction.   \r\n \r\nAprès la sélection il est possible d'agir spécifiquement sur cette sélection, sans modifier les autres atomes du modèle moléculaire.   \r\n\r\n![Sélection](static/img/selectnuc.png)  \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée.","selectProtein":"# Sélectionner les protéines\r\nLes **protéines** présentes dans le modèle moléculaire sont repérées et sélectionnées. Lorsque plusieurs chaînes de protéines sont présentes elles sont toutes sélectionnées sans distinction.   \r\n\r\nAprès la sélection il est possible d'agir spécifiquement sur cette sélection, sans modifier les autres atomes du modèle moléculaire. \r\n\r\n  ![Sélection](static/img/selectpro.png)   \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée.","selectSaccharide":"# Sélectionner les glucides\r\nLes **glucides** présents dans le modèle moléculaire sont repérés et sélectionnés. Lorsque plusieurs types de glucides sont présents, ils sont tous sélectionnés sans distinction. Le passage de la souris sur les atomes permet d'identifier plus précisement les constituants du modèle moléculaire.   \r\n\r\nAprès la sélection il est possible d'agir spécifiquement sur cette sélection, sans modifier les autres atomes du modèle moléculaire.   \r\n\r\n![Sélection](static/img/selectglu.png)  \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée.","selectWater":"# Sélectionner l'eau\r\nLes molécules d'**eau** présentes dans le modèle moléculaire sont repérées et sélectionnées. En général, il s'agit d'atomes d'oxygène isolé.    \r\nEn effet, les techniques d'analyse de la structure tridimensionnelle des molécules ne révèlent pas la position des atomes d'hydrogène. Ils ne sont donc pas représentés dans la plupart des modèles moléculaires.    \r\n\r\nAprès la sélection il est possible d'agir spécifiquement sur cette sélection, sans modifier les autres atomes du modèle moléculaire.   \r\n\r\n![Sélection](static/img/selecteau.png)  \r\nLa pré-visualisation de la sélection s'affiche transitoirement au passage de la souris et permet de vérifier la qualité de la sélection réalisée."}