{"colorBychain":"# Coloration par chaînes\nLa coloration par chaînes identifie les différentes chaînes présentes dans le modèle moléculaire et les colore de manière distincte.\n\nLes principales chaînes identifiées sont :\n* les [protéines](lexicon-protein), constituées d'une ou plusieurs chaînes d'acides aminés,\n* les [acides nucléiques](lexicon-nucleic) (ADN et ARN), constituées de chaînes de nucléotides.\n\nLes [ligands](lexicon-ligand) (eau, ion, hème, ...) associés à une chaîne (protéine ou acide nucléiques) sont également colorés avec les autres atomes de cette chaîne.\n\nLa légende du modèle moléculaire indique les différentes chaînes repérées par leurs identifiants et par leurs colorations spécifiques.","colorByelement":"# Coloration par atomes\nLes atomes sont colorés selon les conventions de la chimie ([coloration CPK](lexicon-cpk)). Ce mode de coloration permet de distinguer les différents éléments chimiques d'une molécule.\n\nLa légende du modèle moléculaire indique les atomes identifiés et leurs colorations.","colorBynature":"# Coloration par nature\nLa coloration par nature identifie la nature chimique des constituants du modèle moléculaire et les colore en fonction de leur nature chimique.\n\nLes principaux groupes identifiés sont :\n* les protéines,\n* les acides nucléiques (ADN et ARN),\n* l'eau,\n* les ions (lorsqu'ils sont identifiés sinon ils intègrent le groupe des hétéro-atomes),\n* les [hétéro-atomes](lexicon-hetero).\n\nTout atome non affecté à un autre groupe est intégré aux hétéro-atomes. Ce groupe est donc très hétérogène et regroupe toutes les molécules chimiques autres que les protéines, les acides nucléiques et l'eau. \n\nLa légende du modèle moléculaire indique pour chaque type de nature chimique repéré son identifiant et sa coloration spécifique.","colorByresidue":"# Coloration par résidus\nUn résidu est un groupe d'atomes constituant une sous-unité d'une chaîne dans un modèle moléculaire. Chaque résidu est identifié par une coloration spécifique.\n\nIl y a plusieurs types de résidus selon la nature de la chaîne.  \nLes principaux résidus sont :\n* les [acides aminés](lexicon-aminoacid) formant les protéines,\n* les [nucléotides](lexicon-nucleotide) formant les [acides nucléiques](lexicon-nucleic) (ADN et ARN).\n\nDes résidus de différentes natures, les [ligands](lexicon-ligand), peuvent également être présents dans les modèles moléculaires :\n* des ligands organiques (glucides, lipides, hème, ...),\n* des ligands minéraux (eau, ions, atomes  métalliques, ...).\n\nLa légende du modèle moléculaire indique pour chaque type de résidu repéré son identifiant et sa coloration spécifique.","colorBysstruc":"# Coloration par structure\n","colorPalette":"# Coloration par palette\nLa coloration par palette est définie par l'utilisateur. Elle s'applique à la sélection en cours.\nElle permet de repérer spécifiquement une partie du modèle moléculaire par sa couleur.\n\nPour l'utiliser :\n* Sélectionner une partie de la molécule,\n* Colorer cette sélection par un clic sur la couleur choisie sur la palette proposée.\n\nLa légende du modèle moléculaire indique la couleur définie par l'utilisateur.","displayBackbone":"","displayBallstick":"","displayCartoon":"","displaySpacefill":"","displayStick":"","hide":"","lexiconAminoacid":"# Acides aminés","lexiconCpk":"# Coloration CPK\nLa code de couleurs CPK (Corey, Pauling et Koltun) est la convention de coloration des atomes en chimie. Il permet d'identifier les atomes dans les modèles moléculaires.\nCe code a été défini par les chimistes R. Corey et L. Pauling puis amélioré par W. Koltun.\nActuellement les outils de visualisation moléculaire utilisent des variations de ce code initial. \nLe code des principaux atomes des molécules organiques est :\n* gris pour Carbone (C)\n* blanc pour Hydrogène (H)\n* rouge pour oxygène (O)\n* bleu pour azote (N)\n* orange pour phosphore (P)\n* jaune pour Soufre (S)\n\nChaque élément chimique est coloré selon une teinte de ce code.","lexiconHetero":"# Hétéro-atomes","lexiconLigand":"# Ligands\nLes ligands sont des molécules de petite taille, liées aux macromolécules (protéines et acides nucléiques) étudiées. Les ligands participent généralement au fonctionnement de la molécule étudiée.  \nLa nature chimique des ligands est variable soit organique, soit minérale.\nLes ligands de nature organique peuvent être des glucides, des lipides, des hèmes ou encore d'autres molécules organiques.\nLes ligands de nature minérale ou inorganique peuvent être des ions, des atomes métalliques ou d'autres molécules inorganiques.\nLes ligands sont liés aux macromolécules par des liaisons non-covalentes qui peuvent être des liaisons ionniques, des liaisons hydrogènes ou encore des forces de van des Waals. \n","lexiconNucleic":"# Acides nucléiques (ADN - ARN)","lexiconNucleotide":"# Nucléotides","lexiconProtein":"# Protéine","selectAll":"","selectHetero":"","selectNucleic":"","selectProtein":"","selectSaccharide":"","selectWater":""}