{"about":"LibMol é un programa educativo de código aberto para o ensino da bioloxía estrutural.  \nPódese usar LibMol como un [programa en liña](https://libmol.org) (accesible sen instalación, mediante un navegador) ou como un [programa executable mediante descarga](https://libmol.org/downloads).\n\n## Autor\n[Paul Pillot](mailto:paul.pillot@libmol.org) - Profesor de Ciencias da Vida no Collège International Marie de France (Montreal - Canada)\n\n\n## Licenza\nO código fonte publícase suxeito a unha [lizenza libre GPL v3.0](https://www.gnu.org/licenses/gpl.html). É un programa de acceso libre, descargable e editable desde o seguinte [repositorio github](https://github.com/ppillot/libmol)\n\n## Agradecementos\n### Contribucións\n- Hervé Furstoss (documentación incrustada)\n- Philippe Cosentino, Sandrine Beaudin, Eric Jourdan, Valérie Rambaud,  Jacques Janin, Frédéric Labaune, Sandra Rodot, Sébastien Gruszka, Nazim Sellal, David Bard, Mélanie Fenaert polos seus moitos tests e suxestións\n- Alexander Rose, autor principal de NGL polo seu esforzo na creación dunha biblioteca de visualización molecular potente, áxil e optimizada para a web.\n\n### Molecular data\n- [Protein Data Bank](https://www.rcsb.org)  \nH.M. Berman, J. Westbrook, Z. Feng, G. Gilliland, T.N. Bhat, H. Weissig, I.N. Shindyalov, P.E. Bourne.\n(2000) _The Protein Data Bank_ [Nucleic Acids Research, 28: 235-242](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC102472/)\n- [Pubchem](https://pubchem.ncbi.nlm.nih.gov/)  \nKim S, Thiessen PA, Bolton EE, Chen J, Fu G, Gindulyte A, Han L, He J, He S, Shoemaker BA, Wang J, Yu B, Zhang J, Bryant SH. PubChem Substance and Compound databases. Nucleic Acids Res. 2016 Jan 4; 44(D1):D1202-13. Epub 2015 Sep 22 [doi:10.1093/nar/gkv951](http://dx.doi.org/10.1093/nar/gkv951)\n\n### Bibliotecas\nLibMol está baseado en varias valiosas bibliotecas ou servizos de acceso aberto.\n- [NGL](https://github.com/arose/ngl) para a visualización 3D de modelos moleculares\n  - AS Rose, AR Bradley, Y Valasatava, JM Duarte, A Prlić and PW Rose. _Web-based molecular graphics for large complexes._ ACM Proceedings of the 21st International Conference on Web3D Technology (Web3D '16): 185-186, 2016. [doi:10.1145/2945292.2945324](http://dx.doi.org/10.1145/2945292.2945324)\n  - AS Rose and PW Hildebrand. _NGL Viewer: a web application for molecular visualization._ Nucl Acids Res (1 July 2015) 43 (W1): W576-W579 publicada por primeria vez en liña o 29 de April de 2015. [doi:10.1093/nar/gkv402](https://doi.org/10.1093/nar/gkv402)\n- [Vue.js](https://vuejs.org/) e o seu ecosistema para a infraestrutura de software\n- [Vuei18n](https://github.com/kazupon/vue-i18n): i18n plugin\n- [ElementUI](http://element.eleme.io/#/en-US): esquema de interfaz de usuario\n- [screenfull](https://www.npmjs.com/package/screenfull): asistencia para pantalla completa\n- [split.js](https://nathancahill.github.io/Split.js/): vistas divididas axustables\n- [Fontello](http://fontello.com): xerador de fontes de iconas  \n\n### Iconas \n- [Font Awesome](http://fortawesome.github.com/Font-Awesome/)\n   Copyright (C) 2016 by Dave Gandy  \n   Author:    Dave Gandy  \n   License:   [SIL](http://scripts.sil.org/OFL)  \n- [Elusive](http://aristeides.com/):  \n   Copyright (C) 2013 by Aristeides Stathopoulos  \n   Author:    Aristeides Stathopoulos  \n   License:   [SIL](http://scripts.sil.org/OFL) \n","colorBychain":"# Colorear segundo a cadea\nEste esquema de cor usa unha cor diferente para cada cadea presente no modelo molecular.\n\nOs principais compoñentes de cadeas son:\n* [proteínas](lexicon-protein), formadas por unha ou máis cadeas de aminoácidos\n* [ácidos nucleicos](lexicon-nucleic) (ADN or ARN), formados por cadeas de nucleótidos\n\n[Ligandos](lexicon-ligand) (auga, ións, grupos hemo...) asociados cun biopolímero (proteína ou ácido nucleico), son considerados parte da cadea e son coloreados da mesma maneira ca esta.  \n\n**Exemplo: proteína formada por 4 cadeas:**  \n![Hemoglobina coloreada por cadeas](static/img/colochain.png)    \nAs estiquetas da barra de estado, debaixo do marco de visualiación, listan as distintas cadeas polos seus IDs e as súas respectivas cores.  \n**Consello**: Manter o indicador sobre o nome das cadeas para mostrar o nome biolóxico completo e relevante da cadea (se é proporcionado polo ficheiro molecular)\n","colorByelement":"# Coloreado CPK (por elemento)\nCada átomo coloréase de acordo co esquema convencional de coloración en química ([Coloración CPK](lexicon-cpk)). Este esquema distingue os diferentes elementos químicos que forman a molécula.\n\nSímbolo | Código de cor | Elemento\n------------ | ------------- | -------------\n**C** | ![Carbono](static/img/c.png)| **Carbono**\n**H** | ![Hidróxeno](static/img/h.png) | **Hidróxeno**\n**O** | ![Oxíxeno](static/img/o.png) | **Oxíxeno** \n**N** | ![Nitróxeno](static/img/n.png) | **Nitróxeno**\n**S** | ![Xofre](static/img/s.png) | **Xofre** \n**P** | ![Fósforo](static/img/p.png) | **Fósforo** \n\n**Coidado**, a maioría dos modelos macromoleculares non incúen **hidróxenos**, aínda que están presentes na molécula. As [Técnicas de determinación de estruturas](lexicon-technique) non poden, en xeral, resolver as coordenadas dos átomos de hidróxeno.  \n\nAs etiquetas da barra de estado, debaixo do marco de visualización, listan os distintos elementos químicos polos seus símbolos e cores.  \n**Consello**: Mater o indicador sobre os símbolos dos elementos para mostar o nome completo do átomo.\n","colorBynature":"# Colorear segundo a natureza química\nEste esquema de coloración colorea os átomos de acordo coa natureza química do composto ao que pertencen  \n\nOs principais compostos identificados son:\n* proteínas,\n* ácidos nucleicos (ADN e ARN),\n* glícidos,\n* auga,\n* ións,\n* [hétero átomos](lexicon-hetero).  \n\n**Exemplo de modelo molecular con compostos bioquímicos variados:**  \n![coloración segundo a natureza bioquímica](static/img/colonat.png)   \n\nCalquera átomo que non pertenza a unha categoría definida clasifícase como hétero. Este grupo é por tanto moi diverso.  \n\nAs etiquetas da barra de estado, debaixo do marco de visualización, especifican calquera natureza química presente no modelo e a súa cor correspondente.\n","colorByresidue":"# Colorear segundo o residuo\nUn residuo agrupa átomos que constitúen unha subunidade dunha cadea (ou polímero) nun modelo molecular. Cada residuo (ou grupo de residuos que se parezan químicamente) ten unha cor específica.\n\nExisten distintos tipos de residuos dependendo na natureza bioquímica da cadea.  \nOs principais grupos son:\n* [aminoácidos](lexicon-aminoacid), que forman parte das proteínas,\n* [nucleótidos](lexicon-nucleotide), que forman parte dos [ácidos nucleicos](lexicon-nucleic) (ADN or ARN).\n\nOutros tipos de residuos, como os [ligandos](lexicon-ligand) (glícidos, grupos prostéticos, ións, etc) e solventes (auga) tamén poden formar parte dos modelos moleculares.\n\nAs etiquetas da barra de estado, debaixo da barra de visualización, especifican todos os residuos presentes no modelo polos seus ID e as súas correspondentes cores.  \n**Consello**: Manter o indicador sobre o ID dun resíduo mostra o seu nome estendido (se esta información está presente no ficheiro do modelo).\n","colorBysstruc":"# Colorear segundo a estrutura secundaria\n\nEste esquema de coloración revela motivos específicos da disposición dos aminoácidos nas cadeas proteicas coñecidos como **estruturas secundarias**. Esta opción está dispoñible só cando as proteínas se seleccionan e se mostran nunha representación simplificada ([esqueleto](display-backbone) ou [fita](display-cartoon)).\n\nAs estruturas secundarias recoñecidas son:\n* [láminas beta](lexicon-strand),  \nAs láminas beta (láminas β) son sucesións lineares de aminoácidos combinadas xeralmente para formar asociacións planas ou cilíndricas na estrutura da proteína.\n* [cóbados](lexicon-turn),  \nOs cóbados son bruscos cambios de dirección na orientación dunha cadea de aminoácidos.\n* [hélices alfa](lexicon-helix),  \nUnha hélice alfa (hélice α) aparece cando a cadea de aminoácidos se enrola ao longo dun eixo. Unha hélice alfa contén unha media de 3,6 aminoácidos por volta.\n* [hélices 3-10](lexicon-helix).  \nUnha hélice 3-10 é un motivo curto comparado coa hélice alfa xa que ten só 3 aminoácidos por volta.\n\nEstes motivos son estabilizados mediante enlaces de hidróxeno entre os aminoácidos.\n\nAs etiquetas da barra de estado, debaixo do marco de visualización, listan cada estrutura secundaria coa súa correspondente cor.  \nA asignación de estruturas secundarias a porcións específicas da cadea de aminoácidos é proporcionada polo ficheiro molecular. Se esta información non estiver dispoñible realizaríase un cálculo usando o método rápido de aliñamento Zhang & Skolnick TM, que podería dar resultados discrepantes.\n","colorPalette":"# Cor de paleta\nÉ unha coloración definida polo usuario. A cor seleccionada aplícase a todos os átomos da selección actual.  \nO seu uso principal é para destacar unha parte específica do modelo molecular.\n\nPara usalo:\n* primeiro, selecione a parte que quere resaltar\n* despois coloréea seleccionando unha cor da paleta \n\nA cor escollida móstrase tamén como unha etiqueta na barra de estado.\n","contactsHbond":"# Enlaes de hidróxeno\nOs átomos electronegativos (como o nitróxeno, o oxíxeno, etc) unidos covalentemente a un átomo de hidróxeno tenden a atraer os electróns para si, a expensas do átomo de hidróxeno. En consecuencia, o átomo de hidróxeno adquire unha carga parcial positiva mentres que o átomo \"dador\" gaña unha carga parcial negativa. Como resultado, o átomo de hidróxeno pode ser atraído por outro átomo electronegativo (denominado \"aceptor\") e formar un enlace de hidróxeno.\n\nA enerxía do enlace de hidróxeno é baixa (arredor de 30 kJ/mol, comparada cos 400 kJ/mol dun enlace covalente) e afecta a átomos separados por distancias curtas (0,2 nm na auga, por examplo).\nO software Libmol (baseado na biblioteca NGL) distingue 4 categorías de enlaces de hidróxeno:\n* **Enlaces de hidróxeno do esqueleto**: son os enlaces entre os nitróxenos e oxíxenos do esqueleto dos aminoácidos próximos nunha cadea polipeptídica. Son os responsables da estrutura secundaria ([hélices](lexicon-helice) e [follas dobradas](lexicon-feuillet))\n* **Enlaces de hidróxeno da auga**: estes enlaces de hidróxeno están, ás veces, implicados nos centros activos de certos enzimas (como as hidrolases)\n* **Enlaces de hidróxeno débiles**: estes enlaces de hidróxeno implican átomos pouco electronegativos (como o carbono)\n* **Outros enlaces de hidróxeno**: estes enlaces explican a maioría das interaccións entre diferentes moléculas ou entre distintas estruturas da proteína.\n","contactsHydrophobic":"# Interaccións hidrofóbicas\nNun ambiente hidratado as moléculas de auga organízanse en grupos que se comportan como gaiolas arredor das cadeas hidrofóbicas. Cando dúas destas cadeas hidrofóbicas se achegan, os grupos de moléculas de auga mestúranse e forman unha asociación máis estable.\n\nUn estudo dos complexos moleculares entre proteínas e ligandos do Protein Data Bank revelou que as interaccións hidrofóbicas son o principal tipo de interaccións non covalentes nas unións entre ligandos e proteínas.\n\nAs interaccións hidrofóbicas son determinantes para certas funcións. Por exemplo, aparecen na unión de ligandos a compartimentos hidrofóbicos (hemo na hemoglobina, dominio de unión a ligando do receptor esteroideo), fixan proteínas de membrana á bicamada lipídica ou forman parte do mecanismo de apertura dos canais para ións.\n \n \n","contactsMetal":"# Interaccións con metais\nEstas interaccións ocorren principalmente entre un catión metálico e os seus ligandos metálicos. Os enlaces denomínanse **dativos** cando están formados por un par de electróns \"tomado\" do ligando (denominado dador, o metal aceptor do enlace). Tamén poden ser **iónicos** cando o metal é un catión que interactúa con anións.\n\nA xeometría destas interaccións depende do número de coordinación do metal. Por exemplo, nas biomoléculas, o número de coordinación do ferro é 6, ocupando o centro dun octaedro.\n","contactsPi":"# Interaccións π-π e cation-π-catión\nOs aminoácidos aromáticos (fenilalanina, tirosina, triptófano, histidina) ou as bases dos ácidos nucleicos poden interactuar con compostos próximos portadores de aneis aromáticos (amoreamento π) ou con catións (interaccións π-catión).  \n\nOs aneis aromáticos amoreándose entre nucleótidos da mesma cadea constitúen unha das principais interaccións nas estruturas dos ácidos nucleicos. A unión de varios ligandos pequenos cos seus respectivos receptores (por exemplo entre a acetilcolina e os receptores nicotínicos) baséase nas interaccións entre os catións dos ligandos e os aminoácidos aromáticos do receptor.\n\nEstas interaccións orixínanse na distribución espacial das densidades electrónicas arredor dos aneis aromáticos (debidas a orbitais π). Por exempo, os centros dos aneis aromáticos teñen unha desnsidae electrónica menor e poden interactuar con bordos de aneis con densidade electrónica alta.\n","contactsSaltbridge":"# Enlace iónico\nEn fase acuosa, dependendo do pH, algúns aminoácidos poden ter unha carga positiva ou negativa. Por exemplo, os aminoácidos cunha cadea lateral ácida  como o glutamato ou o aspartato teñen carga negativa a pH 7. Os [ácidos nucleicos](lexicon-nucleic) tamén teñen cargas negativas nos seus grupos fosfato a pH 7.\n\nDúas moléculas con cargas opostas exercen unha atracción mutua. En caso de estaren suficientemente próximas poden formar un enlace iónico.\n\n","contacts":"# Interaccións non covalentes\nEsta lapela é o lugar para controlar e recibir información acerca das interaccións non covalentes:\n* [Enlaces de hidróxeno](contacts-hbond)\n* [Enlaces iónicos](contacts-saltbridge)\n* [Coordinación metálica](contacts-metal)\n* [Interaccións hidrofóbicas](contacts-hydrophobic)\n* [Amoreamento-π e interaccións catión-π](contacts-pi)\n\n## Definicións\nUnha **interacción covalente** une dous átomos da mesma molécula compartindo un par de **electróns**. As interaccións non covalentes poden ocorrer entre átomos da mesma molécula ou entre dúas moléculas diferentes (como entre unha proteína e un ligando). A enerxía de enlace dunha única interacción non covalente é xeralmente máis feble ca a dun enlace covalente. Estas interaccións son fundamentais para moitos procesos biolóxicos como o contacto entre moléculas, a conformación espacial ou as reaccións bioquímicas.\n\n## Guía\nPara mostrar interaccións cun residuo específico dunha cadea específica pode facer click co botón dereito neste obxecto do modelo ou na **lapela Secuencia**. No menú contextual escolla a opción **Interaccións**.\n","displayBackbone":"# Representación de esqueleto\nEsta representación é unha vista simplificada só aplicable a proteínas e ácidos nucleicos (ADN e ARN).\n\n![Esqueleto](static/img/squ2.png)\n\nO esqueleto é unha liña quebrada que pasa por un átomo representativo en cada residuo do polímero:\n\n* en proteínas, estes son os **carbonos alfa** (carbonos-α) de cada aminoácido. Os carbonos alfa articulan os enlaces peptídicos coas cadeas laterais dos aminoácidos.\n\n![Esqueleto peptídico](static/img/squ1.png)  \n\n* en ácidos nucleicos, estes son os **carbonos C3'** das (desoxi)ribosas dos nucleótidos.  \n\n![Esqueleto nucleico](static/img/sqeun.png)\n\nO esqueleto mostra a base estutural do polímero arredor da cal se organizan os demais compostos (cadeas laterais dos aminoácidos e bases dos ácidos nucleicos) e proporciona ás moléculas as súas propiedades.\n","displayBallstick":"# Representación de bólas e barras\n![Bólas e barras](static/img/bs1.png)  \n\nEsta representación mostra :\n* **(1)** os átomos como esferas, **ás bólas**, \n* **(2)** os enlaces covalentes como segmentos, **as barras**.   \n\nÉ usada para visualizar todos os átomos que forman parte dunha molécula e as conexións covalentes entre elas.  \nDebido ás [limitacións na determinación das coordenadas dos hidróxenos](lexicon-techniques), as moléculas de auga aparecen habitualmente como átomos de oxíxeno individuais nesta representación. \nOs enlaces asígnanse tendo en conta os nomes do aminoácido ou nucleótido nas cadeas e deberían ser proporcionados polo ficheiro de coordenadas de cada composto. Se non estivese presente esta información levaríase a cabo un cálculo, que pode dar resultados discrepantes.\n","displayCartoon":"# Representación de fitas\nEsta representación proporciona unha vista simplificada de **proteínas** e **ácidos nucleicos** (ADN ou ARN). A fita pasa só a través dos átomos que forman parte do esqueleto da molécula ocultando as cadeas laterais e as bases (nos ácidos nucleicos).  \n![Fita](static/img/ruban2.png) \n\nEn **proteínas**:  \n![Representación de fitas en proteínas](static/img/rubanp.png)  \nA fita pasa polos planos dos enlaces peptídicos entre os aminoácidos da cadea. O largo da fita varía a fin de resaltar estruturas secundarias notorias (follas dobradas, hélices alfa...).\n\nEn **ácidos nucleicos**:  \n![Representación de fitas no ADN](static/img/rubann.png)  \nA a traxectoria da fita pasa polas ribosas de cada nucleótido da cadea. As bases nitroxenadas son representadas como barras que emerxen da fita. \n\nDebido ás limitacións de cálculo esta representación non é aplicable a cadeas cunha lonxitude menor de 3 residuos.\n","displaySpacefill":"# Representación de esferas\n![Esferas](static/img/spf1.png)  \nEsta representación mostra:  \n* **(1)** Átomos como esferas cuxos radios son os radios de Van der Walls, que representan a distancia máis próxima ao átomo que se pode acadar.  \n* **(2)** Unha intersección entre dúas esferas revela un enlace químico (principalmente covalente) entre átomos contiguos.\n\nEsta representación é utilizada para visualizar os átomos da molécula e o volume que ocupan. Aplicada a unha molécula completa dá unha idea da súa forma real.\n","displayStick":"# Representación de barras\n![Barras](static/img/st1.png)   \n\nEsta representación usa só segmentos entre os átomos (**as barras**) para mostar a molécula.     \nEstes segmentos proporcionan información acerca de:\n* **(1)** **átomos**, situados nos extremos dos segmentos, marcados xeralmente por ángulos, \n* **(2)** **enlaces covalentes**, que conectan dous átomos.  \n\nÚsase para visualizar claramente os enlaces covalentes entre os átomos da molécula.\nTamén mostra unha silueta clara da molécula ou parte dela.\n","hide":"# Ocultar / Mostar\nEste control oculta e mostra a selección en curso.  \nÉ axeitado para pór o foco nunha porción do modelo molecular mentres se manteñen as representacións do resto.\n\n**Teña en conta** que cando unha selección ou parte dela se oculta, non se poderá visualizar ningunha acción realizada sobre ela ata que o control Mostar se accione.\n","lexiconAminoacid":"# Aminoácidos\nOs aminoácidos son as moléculas que forman as cadeas das proteínas. Teñen dous grupos funcionais (amino e carboxilo) que interactúan entre eles para formaren os enlaces peptídicos.  \nCada aminoácido ten unha cadea lateral específica que lle confire as súas propiedades químicas. \n","lexiconCoude":"# Cóbados\nOs cóbados están entre os principais patróns que adquiren as cadeas de [aminoácidos](lexicon-aminoacid) nunha [proteína](lexicon-protein) (tamén denominadas estruturas secundarias). Un cóbado é unha dobra similar a unha forquita do pelo dintinguible nunha cadea polipeptídica.\n","lexiconCpk":"# Coloración CPK\nO código de coloración CPK (Corey, Pauling and Koltun) é a coloración convencional dos elementos adoptada en química. Identifica os elementos químicos nun modelo molecular.\nEste código foi definido polos químicos R. Corey and L. Pauling e mellorado despois por by W. Koltun. As actuais ferramentas de visualización de moléculas usan variacións deste código.\n\nO código dos principais elementos nas moléculas orgánicas é o seguinte:\n\nSímbolo | Código de coloración | Elemento\n------------ | ------------- | -------------\n**C** | ![Carbono](static/img/c.png)| **Carbono**\n**H** | ![Hidróxeno](static/img/h.png) | **Hidróxeno**\n**O** | ![Oxíxeno](static/img/o.png) | **Oxíxeno** \n**N** | ![Nitróxeno](static/img/n.png) | **Nitróxeno**\n**S** | ![Xofre](static/img/s.png) | **Xofre** \n**P** | ![Fósforo](static/img/p.png) | **Fósforo** \n","lexiconHelix":"# Hélices\nAs hélices están entre os principais patróns que adoptan as cadeas dos [aminoácidos](lexicon-aminoacid) dunha [proteína](lexicon-protein) (coñecidos tamén como estrutura secundaria).  \nNunha hélice a cadea de aminoácidos enrólase arredor dun eixe. As cadeas laterais dos aminoácidos apuntan para o exterior do eixe da hélice. Os aminoácidos dunha hélice establecen enlaces de hidróxeno con aminoácidos da seguinte volta e da anterior.\nDependendo do **paso** da hélice (número de aminoácidos por volta) defínense distintas categorías (hélice α, hélice 3-10 e hélice π, que teñen respectivamente 3,6, 3 e 5 aminoácidos por volta).\n","lexiconHetero":"# Heteroátomos\nEsta clase de compostos é diversa. Inclúe todas as moléculas que non pertencen aos seguintes grupos: [proteínas](lexicon-protein), [ácidos nucleicos](lexicon-nucleic), moléculas de auga ou carbohidratos.  \nContén [ligandos](lexicon-ligand) asociados a proteínas como o grupo hemo nas globinas, certas vitaminas que son cofactores, ións implicados na catálise, etc.  \nTamén inclúe os lípidos que rodean algunhas proteínas de membrana ou outras substancias usadas como solventes durante a determinación experimental.\n","lexiconLigand":"# Ligandos\nOs **ligandos** son moléculas pequenas que están unidas ás macromoléculas estudadas (proteínas e ácidos nucleicos). Os ligandos poden estar implicados na función da molécula.\nA natureza química dos ligandos pode ser orgánica ou inorgánica.\nOs ligandos orgánicos poden ser carbohidratos, lípidos, hemos, ou calquera outra molécula orgánica.\nOs ligandos únense ás macromoléculas mediante enlaces covalentes ou non covalentes (iónicos, de hidróxeno, forzas de Van der Waals). \n","lexiconNucleic":"# Ácidos nucleicos (ADN - ARN)\nOs ácidos nucleicos son moléculas orgánicas de tamaño grande cuxa función principal é almacenar e transmitir información xenética.  \nEstán formados por unha sucesión de unidades construtivas: os [nucleótidos](lexicon-nucleotide).  \nO seu nome deriva do feito de teren sido identificados por primeira vez no núcleo e de os nucleótidos conteren una **base nitroxenada** e unha molécula de  **ácido fosfórico**.  \nA diferenza entre o ADN e o ARN é o tipo de monosacárido presente nos seus nucleótidos, **desoxirribosa** para o ADN e **ribosa** para o ARN.  \nOs nucleótidos únense cos seus veciños da mesma cadea por un enlace covalente entre o grupo fosfato e a (desoxi)ribosa.  \nO ADN contén tipicamente dúas cadeas nucleotídicas unidas por enlaces de hidróxeno entre as bases nitroxenadas. O ARN adoita estar formado por unha soa cadea, que se pode dobrar sobre si mesma formando estruturas secundarias estabilizadas por enlaces entre as bases (bucles, forcas, etc.).  \nEn Libmol, pódense distinguir os dous tipos de ácidos nucleicos utilizando o patrón de coloración [coloración por naturaleza bioquímica](color-bynature). Pódense seleccionar de forma diferenciada coa palabra chave ADN ou ARN na [liña de comandos de selección](select-command-line).  \n","lexiconNucleotide":"# Nucleótidos\nOs nucleótidos son os monómeros dos [ácidos nucleicos](lexicon-nucleic) como o __ADN__ ou o __ARN__. \nUn nucleótido está formado por tres partes:\n* a __base nitroxenada__. Hai cinco tipos diferentes (__adenina__, __guanina__, __timina__, __citosina__ e __uracilo__) que poden sufrir modificacións (particularmente nas moléculas de ARN)\n* o __monosacárido__, que pode ser __ribosa__ (no ARN), ou __desoxirribosa__ (no ADN)\n* o grupo __fosfato__\n","lexiconOther":"# Outros átomos\n","lexiconProtein":"# Proteínas\nAs proteínas son macromoléculas orgánicas complexas formadas como mínimo por unha cadea de [aminoácidos](lexicon-aminoacid).\nA composición aminoacídica (que depende da información xenética) é a principal responsable da forma e función das proteínas.  \nAs proteínas desempeñan moitas funcións diferentes no interior e exterior das células:\n* Comunicación (mensaxeiros peptídicos, receptores)\n* Estrutura (compoñentes do citosqueleto, a matriz extracelular, a cromatina e os cromosomas ...)\n* Reaccións químicas (enzimas)\n* Defensa e ataque (toxinas peptídicas, anticorpos, receptores do sistema inmunitario)\n* Etc\n","lexiconStrand":"# Láminas dobradas\nAs láminas dobradas ou láminas β están entre os patróns principais que adoptan as cadeas de [aminoácidos](lexicon-aminoacid) nunha [proteína](lexicon-protein) (coñecidas tamén como estruturas secundarias).  \nAs láminas dobradas ou láminas β teñen unha conformación plana. As cadeas laterais dos aminoácidos apuntan xeralmente de xeito perpendicular ao plano da lámina. Os aminoácidos únense ás láminas próximas mediante enlaces de hidróxeno. As láminas contiguas poden formar motivos como os barrís β.\n","lexiconTechnique":"# Técnicas para a determinación de estruturas moleculares.\n\nAs moléculas non se poden observar directamente mediante técnicas convencionais. Utilízanse técnicas indirectas para deseñar modelos destas moléculas.\n\n## Cristalografía de raios X\nA molécula estudada purifícase e colócase despois en condicións de cristalización para formar unha morea ordenada. Cando un feixe de raios X se dirixe a este cristal as ondas electromagnéticas difráctanse e orixinan figuras de interferencia nun detector (un conxunto de puntos). A posición destes puntos depende da nube electrónica da molécula, que pode ser reconstruída por métodos matemáticos.  \nOs aminoácidos da proteína poden entón ser encaixados nesta nube electrónica para construír un modelo completo.  \nEste método é o máis utilizado para a determinación de modelos moleculares. A resolución é normalmente demasiado baixa para determinar as posicións dos átomos de hidróxeno; así que non aparecen nos modelos. Cabe sinalar que se trata só dun modelo, e que as moléculas estudadas están en condicións moi distintas das condicións biolóxicas durante o proceso de determinación. Por outra parte, algunhas proteínas non cristalizan e non poden ser determinadas con esta técnica.\n\n## Espectroscopía de Resonancia magnética nuclear (NMR)\nUnha solución da mostra que se quere analizar colócase nun campo magnético forte. Os átomos son sometidos a ondas de radio. A análise das resonancias observadas utilízase para determinar os átomos próximos, así como a conformación dos enlaces entre eles. A partir destas informacións obtense un conxunto de condicionantes que se utilizan para resolver os diferentes modelos compatibles. Así, a técnica RMN xera un conxunto de varios modelos posibles. Resulta axeitada para moléculas pequenas e medianas e ten a vantaxe de que se aplica a moléculas en solución, o que supón condicións más próximas ás biolóxicas ca no caso dos cristais.\n\n## Microscopía electrónica 3D (3DEM)\nEsta técnica está actualmente en plena expansión. O termo engloba unha ampla gama de procedementos experimentais. Pode consistir, por exemplo, na obtención de imaxes de complexos de gran tamaño desde diferentes ángulos. Aplícanse métodos de análise de imaxe por computadora para crear, a partir destes conxuntos de datos, unha estrutura tridimensional. A difracción de electróns pode realizarse se a estrutura ten periodicidade suficiente ou pode cristalizar. Cando a resolución é baixa, esta técnica combínase coa cristalografía para axustar as estruturas atómicas procedentes da cristalografía á envoltura obtida por 3DEM.  \n","selectAll":"# Seleccionar todos os átomos\nEste control selecciona o **conxunto completo de átomos** presente no modelo molecular, independentemente da natureza química dos compostos a que pertenzan e da cadea na que estean.\n\n![Selección](static/img/select.png)\nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula que permite verificar a calidade da selección.\n","selectCommandLine":"# Selecionar mediante Comandos de selección\nEsta caixa de texto permite introducir un comando de selección para realizar seleccións máis complexas ou máis axiña que a través do modo secuencia.\nOs átomos que teñan as características indicadas polas palabras chave serán seleccionados.\n\nDespois de introducir un comando correcto realice a selección premendo a tecla Intro ou facendo click no botón de validación.\n\nA previsualización da selección móstrase mentres se pasa o rato por riba da molécula e permite verificar a calidade da selección. A barra de selección mostrará o número de átomos seleccionados. Se non fose posible procesar a selección o texto aparecerá en vermello.\n\n## Exemplos de comandos de selección\n| Comandos | Seleccións asignadas |\n| ---------- | -------------------------- |\n| `val` | Todas as valinas |\n| `val and 10` | Todas as valinas en posición 10 nas cadeas\n| `:B` | Cadea B **(distingue maiúsculas e minúsculas)**\n| `10:B` | O aminoácido (ou nucleótido) en posición 10 na cadea B\n| `_C` | Todos os átomos de carbono\n| `ala and .ca and not 10` | Todos os carbonos alfa das alaninas excepto o aminoácido en posición 10\n| `protein and not (:C,:B)` | Todos os átomos pertencentes a proteínas pero non ás cadeas C nin B\n\n## Palabras chave\n| Palabra chave | Significado\n| ----------- | ------\n| `all` | Todos os átomos\n| `protein` | Proteínas e aminoácidos\n| `nucleic` | ADN, ARN e nucleótidos\n| `dna` | ADN\n| `rna` | ARN\n| `hetero` | Heteroátomos\n| `saccharide` | Carbohidratos\n| `ion` | Ións\n| `water` | Auga\n| `polymer` | Proteína, ADN or ARN\n| `backbone` | Esqueleto dunha proteína ou ácido nucleico\n| `sidechain` | Cadea lateral dun aminoácido ou base nitroxenada\n| `helix` | Hélices\n| `sheet` | Follas dobradas\n| `turn` | Estrutura secundaria sen hélices nin follas dobradas\nVer máis palabras chave na [Documentation NGL](http://arose.github.io/ngl/api/tutorial-selection-language.html)\n\n## Sintaxe\n| Expresión | Significacdo\n| --------------- | ---------------\n| `1,2,3` | Selección de residuos polo seu número\n| `1-10` | Selección dunha secuencia de residuos (aquí, do 1 ao 10)\n| `:A` | Seleccionar unha cadea polo seu identificador\n| `#H,#C,#O` | Selección de átomos polo seu símbolo\n| `.CA,.N3` | Selección de átomos polo seu nome no ficheiro PDB\n| `ALA,HEM` | Selección de residuos polo seus nomes\n| `[032],[CT1]` | Selección de residuos cuxos nomes conteñen díxitos\nBusque na [Documentation NGL](http://arose.github.io/ngl/api/tutorial-selection-language.html) exemplos máis avanzados\nAs expresións e palabras chave poden ser combinadas usando operadores lóxicos (`AND`,` OR`, `NOT`). Pódense usar parénteses para agrupar expresións e establecer prioridades entre as combinacións.\n","selectHetero":"# Seleccionar outros átomos\nEste control selecciona os átomos que non forman parte de ningún dos conxuntos de átomos definidos (é o mesmo que especificar que non se trata de proteínas, nin ácidos nucleicos, nin carbohidratos, nin agua). É un grupo moi diverso que inclúe ligandos, ións, lípidos de membrana, etc...  \n![Seleccionar](static/img/select.png)   \nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula, que permite verificar a calidade da selección.\n","selectNucleic":"# Seleccionar ácido nucleico (ADN ou ARN)\nEste control selecciona os **[ácidos nucleicos](lexicon-nucleic)** presentes no modelo molecular. Este comando selecciona todas as cadeas de ácido nucleico ou os nucleótidos individuais.   \n \nDespois de seleccionar pódese operar (representar, colorear ...) sobre os átomos seleccionados sen afectar o resto do modelo.\n\n![Seleccionar ácidos nucleicos](static/img/selectnuc.png)  \nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula, que permite verificar a calidade da selección.\n","selectProtein":"# Seleccionar proteína\nEste control selecciona as **[proteínas](lexicon-protein)** presentes no modelo molecular. O comando selecciona todas as cadeas peptídicas ou aminoácidos individuais.  \n\nDespois de seleccionar pódese operar (representar, colorear...) sobre os átomos seleccionados sen afectar o resto do modelo molecular.\n\n![Seleccionar proteína](static/img/selectpro.png)   \nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula, que permite verificar a calidade da selección.\n","selectSaccharide":"# Seleccionar carbohidratos\nEste control selecciona os **carbohidratos** (ou **glícidos**) presentes no modelo molecular. Este comando selecciona calquera glícido independentemente da súa natureza química.   \n\nDespois de seleccionar pódese operar (representar, colorear...) sobre os átomos seleccionados sen afectar o resto do modelo molecular. \n![Seleccinoar glícidos](static/img/selectglu.png)  \nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula, que permite verificar a calidade da selección.\n","selectWater":"# Selecionar auga\nEste control selecciona as **moléculas de auga** presentes no modelo molecular. Aparecen xeralmente como átomos de oxíxeno individuais xa que as posicións dos hidróxenos non se poden resolver a partir dos datos obtidos coa maioría das [técnicas](lexicon-technique) de determinación de estruturas moleculares. Só aparecen algunhas das moléculas de auga xa que a súa posición pode variar nas diferentes celas unidade que compoñen o cristal na determinación.   \n\nDespois de seleccionar pódese operar (representar, colorear...) sobre os átomos seleccionados sen afectar o resto do modelo molecular.   \n\n![Selecionar auga](static/img/selecteau.png)  \nMóstrase unha previsualización da selección mentres o rato se move sobre a molécula, que permite verificar a calidade da selección.\n"}